verification/runs/T-family/E4a2_runs/F_f/system/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    // NO residualControl (L-141): convergence is judged by the frozen
    // comparator from written checkpoints, never by the solver.
}

relaxationFactors
{
    fields    { p 0.3; }
    equations { U 0.7; }
}
